Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: Notice that the log level set explicitly for the transactions code overrides the log level of the parent component but that all other database code subcomponents inherit its setting by default and so won't generate any log messages at all.
ja: トランザクションコードで明示的に設定されたログレベルは親コンポーネントのログレベルを上書きしますが、データベースコードの他のサブコンポーネントはすべて親コンポーネントの値を継承するため、ログメッセージはまったく生成されません。

source: Notice that the narrow strings used with wxWidgets are always assumed to be in the current locale encoding, so writing
ja: wxWidgets で使用されるナロー文字列は 常に 現在のロケールで符号化されていると仮定されます。

source: Notice that the use of log trace masks is hardly necessary any longer in current wxWidgets version as the same effect can be achieved by using different log components for different log statements of any level.
ja: 現在の wxWidgets では、もはやトレースマスクを使用する必要性がほとんどないことに注意してください。なぜなら、異なるログ文に対して異なるログコンポーネントを使用することで同じ事を実現できるためです。

source: Notice that this is done before checking the static event table entries, so if both a dynamic and a static event handler match the same event, the static one is never going to be used unless wxEvent::Skip() is called in the dynamic one.
ja: これは静的イベントハンドラをチェックする前に行われることに注意してください。そのため、動的イベントハンドラと静的イベントハンドラの両方がイベントに合致した場合、動的イベントハンドラで wxEvent::Skip() を呼ばない限りは静的イベントハンドラが呼ばれることはありません。

source: Notice that this means that any event handler defined in a base class will be executed at this step.
ja: これは基底クラスで定義されたイベントハンドラがこのステップで実行されうることを意味します。

source: Notice that to avoid remembering the exact order in which the events are processed in the document-view frame, the simplest, and recommended, solution is to only handle the events at the view classes level, and not in the document or document manager classes
ja: ドキュメント/ビューフレームワークでの正確なイベント処理順を覚えなくてもいいようにする、もっとも単純で推奨する解決方法は、ビュークラスでのみイベントを処理し、ドキュメントやドキュメントマネージャでは処理しないことです。

source: Notice that you may want to run the Event Sample while reading this section and look at its code and the output when the button which can be used to test the event handlers execution order is clicked to understand it better.
ja: おそらく、この章を読みながら イベントサンプル を実行し、コードや (イベント処理順序を確認するために) ボタンをクリックした時の出力を見たくなると思います。

source: Notice that you must mention a method you want to use for the event handling in the event table definition; just defining it in MyFrame class is not enough.
ja: イベント処理に使用したいメンバ関数はイベントテーブル内に記載する必要があることに注意してください; MyFrame クラス内で定義するだけでは 不十分 です。

source: Now let us describe the semantic differences:
ja: さて、意味論的な違いについて説明しましょう:

source: Of course, all the standard string operations are supported as well.
ja: もちろん、標準的な文字列操作にも対応しています。

source: Of course, in some situations threads really make sense (classical example is a server application which launches a new thread for each new client), but in others it might be a very poor choice (example: launching a separate thread when doing a long computation to show a progress dialog).
ja: もちろん、いくつかの状況ではスレッドは本当に意味がありますが (古典的な例ではサーバアプリケーションでクライアントごとに新しいスレッドを実行することが挙げられます)、それ以外の場合ではお粗末な選択になるでしょう。(例: 長い計算をするときにプログレスダイアログを表示するために別のスレッドを実行する)

source: Of course, in some situations threads really make sense (classical example is a server application which launches a new thread for each new client), but in others it might be an overkill.
ja: もちろん、いくつかの状況ではスレッドは本当に意味がありますが (古典的な例ではサーバアプリケーションでクライアントごとに新しいスレッドを実行することが挙げられます)、それ以外の場合ではやり過ぎでしょう。

source: Of course, it would be nearly impossibly to write such programs if it had to be done this way (try to imagine the number of #ifdef UNICODE an average program would have had!).
ja: もちろん、この方法でプログラムを書くのは不可能に近いでしょう。 (平均的なプログラムに含まれることになるであろう #ifdef UNICODE の数を想像してみてください!)

source: Of course, it's also possible to emulate this behaviour with the classic static (i.e., bound via event tables) handlers by using an internal flag indicating whether the handler is currently enabled and returning from it if it isn't, but using dynamically bind handlers requires less code and is also usually more clear.
ja: もちろん、イベントハンドラの有効無効を表す内部フラグを用いることで、古典的な静的イベントハンドラ (つまり、イベントテーブル) でもこの振る舞いを模倣することは可能です。しかし、動的にバインドされるイベントハンドラを使用する方がコードも少なく、処理内容も明確になります。

source: Of course, the latter only works if the string contains data representable in the current locale encoding.
ja: もちろん、文字列が現在のロケールのエンコーディングで表現可能である場合のみ、後者の型で正しくアクセスできます。

source: Of course, the usual standard C functions don't work with wchar_t strings, so another set of functions exists which do the same thing but accept wchar_t * instead of char *.
ja: もちろん、普通の標準 C 関数は wchar_t 文字列をうまく取り扱うことができません。そのため、char * の代わりに wchar_t * を受け取る別の関数群が用意されています。

source: Of course, this will change the format of the wxConfig output which may be undesirable.
ja: もちろん、これは望ましくない wxConfig の出力形式を変更します。

source: Of course, you may also use wxString::Printf which is also safe.
ja: もちろん、wxString::Printf も安全なので使用しても構いません。

source: On the other hand, event tables are more succinct and centralize all event handler bindings in one place.
ja: 一方で、イベントテーブルの方が簡潔であり、すべてのイベントハンドラを一箇所に集約することができます。

source: On the other hand, event tables are still perfectly fine in simple situations where this extra flexibility is not needed.
ja: 一方で、追加の柔軟性が必要とされないような単純な状況では、イベントテーブルもまだ充分に役立ちます。

source: On the other hand, the features provided make them very useful for storing all kinds of small to medium volumes of hierarchically-organized, heterogeneous data.
ja: 一方で、階層構造を持ち、小規模から中規模であるすべての種類のデータを格納するのにこれらの提供機能が非常に役立ちます。

source: On the other hand, the recent evolution of the computer hardware shows an important trend towards multi-core systems, which are better exploited using multiple threads (e.g. you may want to split a long task among as many threads as many CPU (cores) the system reports; see wxThread::GetCPUCount).
ja: 一方で、近年のハードウェアの進歩はマルチコアシステムに関する重要な動向を見せており、マルチコアシステムではマルチスレッドをより有効活用できます。(例えば、長時間の計算を CPU 数と同じ数のスレッドに分割したいと思うかもしれません; wxThread::GetCPUCount を参照してください)

source: On the other hand, there is no particular harm in leaving them neither as the code will still compile and work correctly -- you only need to remove them if you think that your code looks tidier without them.
ja: 一方で、これらのマクロを残しておいても以前としてコンパイルできますし、正しく動作するため、特に害はありません。これらのマクロを削除してコードを綺麗にしたい場合だけ、マクロを削除する必要があります。

source: On the other hand, you still need to know about the event tables if only because you are going to see them in many samples and examples.
ja: 一方で、単に多くのサンプルでイベントテーブルを見かけるからという理由だけであっても、イベントテーブルについて学ぶ必要性は依然として残っています。

source: Once you have chosen which object you want to use to convert your text, here is how you would use them with wxString.
ja: 変換に使用したいオブジェクトを選択したら、それらを wxString と一緒に使用する方法を以下に示します。

source: One area where wxWidgets can help is in adapting dialogs for the lower resolution screens that inevitably accompany a smaller form factor.
ja: wxWidgets が支援できることのひとつにダイアログを (より小さいフォームファクタに付きものな) より低解像度の画面に適応させることが挙げられます。

source: One is to define a entirely new event class (typically deriving from wxEvent or wxCommandEvent.
ja: ひとつは完全に新しいイベントクラスを定義することです。 (通常は wxEvent か wxCommandEvent を継承します)

source: One of the unfortunate consequences of the possibility to pass wxString to wxPrintf() without using c_str() is that it is now impossible to pass the elements of unnamed enumerations to wxPrintf() and other similar vararg functions, i.e.
ja: c_str() を使用せずに wxString を wxPrintf() へ渡せるようにした不幸な結果のひとつとして、無名 enum の要素を wxPrintf() や類似の可変長関数へ渡せなくなりました。

source: One of them uses event table macros and allows you to define the binding between events and their handlers only statically, i.e., during program compilation.
ja: ひとつは イベントテーブル マクロを使用する方法で、静的 (コンパイル時) にのみ、イベントとそのハンドラをバインドすることができます。

source: One stream can have multiple stream buffers but one stream has always one autoinitialized stream buffer.
ja: ひとつのストリームは複数のストリームバッファを持つことができますが、ストリームは常にひとつの自動初期化済みのストリームバッファを持ちます。

source: One stream can have multiple stream buffers but one stream have always one autoinitialized stream buffer.
ja: ひとつのストリームは複数のストリームバッファを持つことができますが、ストリームは常にひとつの自動初期化済みのストリームバッファを持ちます。

source: One use of PushEventHandler is to temporarily or permanently change the behaviour of the GUI.
ja: PushEventHandler の使用法のひとつは、一時的または永続的に GUI の振る舞いを変更することです。

source: Only one log target is active at any moment, this is the one used by wxLogXXX() functions.
ja: いつでも 有効な ログターゲットはひとつだけで、これが wxLogXXX() 関数によって使用されます。

source: Only the binary files are needed during program execution.
ja: プログラム実行時にはバイナリファイルだけが必要です。

source: Only the handlers actually required by the application need to be overridden.
ja: このとき、実際にアプリケーションで必要となるハンドラだけをオーバーライドする必要があります。

source: OpenLogFile(s); // ERROR: ambiguity
ja: OpenLogFile(s); // エラー: 曖昧

source: OpenLogFile(s.wx_str()); // OK: function called depends on the build
ja: OpenLogFile(s.wx_str()); // OK: ビルドに応じて関数が呼ばれる

source: OpenLogFile(s.mb_str()); // OK: always calls narrow string overload
ja: OpenLogFile(s.mb_str()); // OK: 常にナロー文字列用のオーバーロードが呼ばれる

source: OpenLogFile(s.wc_str()); // OK: always calls wide string overload
ja: OpenLogFile(s.wc_str()); // OK: 常にワイド文字列用のオーバーロードが呼ばれる

source: OpenLogFile(s.c_str()); // ERROR: ambiguity
ja: OpenLogFile(s.c_str()); // エラー: 曖昧

source: Opens the file, returning true if successful.
ja: ファイルをオープンします。オープンに成功したら true を返却します。

source: Or, you can use identifiers below wxID_LOWEST.
ja: もしくは wxID_LOWEST 以下の識別子を使用することもできます。

source: Other (future) implementations of wxConfigBase might also understand GTK resource files or their analogues on the KDE side.
ja: 他の (将来の) wxConfigBase の実装では GTK リソースファイルや、KDE におけるその類似品も扱えるようになるかもしれません。

source: Other Kinds of Windows
ja: 他の種類のウィンドウ

source: Other Types of Sizers
ja: その他のサイザー

source: Other implementation choices are available: for the progress dialog example it is far better to do the calculations in the idle handler or even simply do everything at once but call wxWindow::Update() periodically to update the screen.
ja: 他の実装方法を選択することは可能です: プログレスダイアログの例で言うと、アイドルハンドラ で計算を行なうか、もしくは単純に一度に計算を行い、画面を更新するために定期的に wxWindow::Update() を呼び出す方がずっと良い方法です。

source: Other unexpected compilation errors may arise but they should happen even more rarely than the above-mentioned ones and the solution should usually be quite simple: just use the explicit methods of wxUniChar and wxCStrData classes instead of relying on their implicit conversions if the compiler can't choose among them.
ja: 他にも予期しないコンパイルエラーが発生することがありますが、発生頻度が上で挙げたものより少なく、解決方法も非常に単純です: コンパイラが wxUniChar と wxCStrDatajust のどちらを使用すれば良いか判断できない場合には、暗黙的な変換に頼るのではなく、明示的にそれらの関数を使用するだけです。

source: Otherwise if the window has children then the best size is set to be large enough to show all the children.
ja: そうでない場合、ウィンドウが子コントロールを持っていれば、すべての子コントロールを表示するのに充分な最適サイズが設定されます。

source: Otherwise if the window has layout constraints then that is used to calculate the best size.
ja: そうでない場合、ウィンドウでレイアウト制約が使用されていれば、それが最適サイズの計算に使用されます。

source: Otherwise if there are no children then the window's min size will be used for the best size.
ja: そうでない場合、子コントロールが存在しないのであれば、ウィンドウの最小サイズが最適サイズに使用されます。

source: Otherwise if there is no min size set, then the current size is used for the best size.
ja: そうでない場合、最小サイズが設定されていないのであれば、現在のサイズが最適サイズに使用されます。

source: Otherwise you can only use the global wxTheApp pointer which is of type wxApp*.
ja: そうしない場合、wxApp * 型のグローバル変数である wxTheApp ポインタを使用するしかありません。

source: Otherwise you can only use the global wxTheApp pointer which is of type wxApp *.
ja: そうしない場合、wxApp * 型のグローバル変数である wxTheApp ポインタを使用するしかありません。

source: Otherwise, the return value is a string (actually a pointer to the connection buffer, so it should not be deallocated by the application).
ja: それ以外の場合、戻り値は文字列になります。(実際には接続バッファへのポインタであるため、アプリケーション側で解放しないでください)

source: Overridden wxEventFilter method.
ja: wxEventFilter をオーバーライドした関数。

source: Override the functions CanDoLayoutAdaptation and DoLayoutAdaptation to test for adaptation applicability and perform the adaptation.
ja: 適応の可否の確認や適応を行なうには CanDoLayoutAdaptation と DoLayoutAdaptation をオーバーライドします。

source: Override this member function for any processing which needs to be done as the application is about t...
ja: アプリケーションの終了時に処理を行なう必要がある場合にこのメンバ関数をオーバーライドしてください。

source: Override this to perform layout adaptation, such as making parts of the dialog scroll and resizing th...
ja: ダイアログの一部をスクロールしたり、画面に合わせてダイアログをリサイズするなど、レイアウトの適応を行なう場合にこの関数をオーバーライドしてください。

source: Override this to react to a left click.
ja: 左クリックに反応するにはこの関数をオーバーライドしてください。

source: Override this to react to cell activation.
ja: セルのアクティブ化に反応するにはこの関数をオーバーライドしてください。

source: Override this to return a window containing the main content of the dialog.
ja: ダイアログのメインコンテンツを含むウィンドウを返却するためにこの関数をオーバーライドしてください。

source: Override this to start a drag operation.
ja: ドラッグ操作を開始するにはこの関数をオーバーライドしてください。

source: Performance Implications of Using UTF-8
ja: UTF-8 を使用することによる性能への影響

source: Performs a keyboard navigation action starting from this window.
ja: このウィンドウから始まるキーボードナビゲーション処理を実行します。

source: Performs layout adaptation, usually if the dialog is too large to fit on the display.
ja: レイアウトの適応を行います。これは通常、画面サイズに対してダイアログが大きすぎる場合に行われます。

source: Planes are numbered from 0 to 16, where the first one is the BMP, or Basic Multilingual Plane.
ja: 面は 0 から 16 までの番号が振られており、最初の面が BMP (基本多言語面) です。

source: Platform-specific methods for creating a wxBitmap object from an existing file are catered for, and this is an occasion where conditional compilation will sometimes be required.
ja: 既存のファイルから wxBitmap オブジェクトを作成するのにプラットフォーム独自の関数が提供されていますが、ときにこれは条件付きコンパイルを必要とすることがあります。

source: Please consult wxWidgets home page for the most up-to-date translations - and if you translate it into one of the languages not done yet, your translations would be gratefully accepted for inclusion into future versions of the library!
ja: 最新の翻訳版は wxWidgets のホームページを参照してください。そして、あなたが wxWidgets をまだ翻訳されていない言語に翻訳した場合、私達はそれを将来のバージョンに含めることを喜んで承認するでしょう!

source: Please note that at() method has the same problem as the subscript operator in this situation and so using it is not really better.
ja: このような状況では at() 関数にも添字演算子と同じ問題があるため、この関数を使用するのは本当に良いとは言えません。

source: Please note that this class is specially optimized (using its knowledge of the internal structure of wxString) for storing strings and so it is vastly better from a performance point of view than a wxObjectArray of wxStrings.
ja: このクラスは (wxString の内部構造に関する知識を用いて) 文字列の格納に特化して最適化されています。そのため、wxObjectArray に wxString を格納するより性能面で優れています。

source: Please read Internationalization which describes the locales concept.
ja: ロケールの概念については 国際化 を参照してください。

source: Please read the Internationalization which describes the locales concept.
ja: ロケールの概念については 国際化 を参照してください。

source: Please refer to these sections for details.
ja: 詳細は各章を参照してください。

source: Please see Dynamic Event Handling for the discussion of Bind<>().
ja: Bind<>() についての議論は 動的イベント処理 を参照してください。

source: Please see Log Messages Selection for more information about the log components.
ja: ログコンポーネントについての詳細は ログメッセージの選択 を参照してください。

source: Please see Unicode-related Changes for the details of these changes.
ja: 変更の詳細は Unicode に関連する変更 を参照してください。

source: Please see its documentation for more details.
ja: 詳細はドキュメントを参照してください。

source: Please skip it unless you feel familiar with profilers and relative tools.
ja: プロファイラやその関連ツールについて詳しくないのであればこの章を読み飛ばしてください。

source: Pluggable Event Handlers
ja: 動的イベントハンドラ

source: Post an event to be processed later.
ja: あとで処理されるイベントを送信します。

source: Potential Unicode Pitfalls
ja: Unicode の潜在的な落とし穴

source: Preallocate enough space for wxString to store nLen characters.
ja: nLen 文字を格納するために必要なメモリを wxString に事前に割り当てる。

source: Preferred:
ja: 推奨:

source: Previous versions of wxWidgets used to rely on the creation of a global application object, but this is no longer recommended, because required global initialization may not have been performed at application object construction time.
ja: 以前の wxWidgets ではグルーバルなアプリケーションオブジェクトを作成していましたが、もはやこれは非推奨です。なぜなら、期待したグローバルオブジェクトの初期化がアプリケーションオブジェクトの構築時に行われない可能性があるためです。

source: Probably the main trap with using this class is the implicit conversion operator to const char*.
ja: おそらく、このクラスを使用する際の一番の罠は const char * への暗黙の型変換演算子です。

source: Probably the main trap with using this class is the implicit conversion operator to const char *.
ja: おそらく、このクラスを使用する際の一番の罠は const char * への暗黙の型変換演算子です。

source: Probably the unique case when you might want to think about reference counting is when a string character is taken from a string which is not a constant (or a constant reference).
ja: ただ、非 const (もしくは非 const 参照) の文字列から文字を取り出すときだけは参照カウンタを意識する必要があると考えることでしょう。

source: Processes an event, searching event tables and calling zero or more suitable event handler function(s...
ja: イベントテーブルを検索し、0 個以上の適切なイベントハンドラ関数を呼び出してイベントを処理します。

source: Purpose of wxStream
ja: wxStream の目的

source: Pushes this event handler onto the event stack for the window.
ja: このイベントハンドラをウィンドウのイベントスタック上に追加します。

source: Put any application-wide cleanup code in wxApp::OnExit (this is a virtual function, not an event handler).
ja: アプリケーション全体の後処理は wxApp::OnExit (これは仮想関数であって、イベントハンドラではありません) に配置してください。

source: Putting the same line in a child event table will crash during run-time because the MyFrame method will be called on a wrong object -- it's easy to convince oneself that the only object that can be used here is the pointer to the child, as wxWidgets has nothing else.
ja: 同じ内容を子イベントテーブルへ配置した場合、実行時にクラッシュするでしょう。なぜなら、異なる型のオブジェクトに対して MyFrame メンバ関数を呼びだそうとするためです。ここでは子コントロールのポインタしか使用できないからだということは簡単に分かってもらえると思います。

source: Queue an event for processing on the given object.
ja: 特定のオブジェクトで処理するためにイベントをキューへ追加します。

source: Queue event for a later processing.
ja: あとで処理するためにイベントをキューに追加します。

source: Rather than just setting an "initial size" attribute it actually sets the minimal size to the value passed in, blends that value with the best size, and then sets the size of the widget to be the result.
ja: 単に "初期サイズ" を設定するのではなく、引き渡された値を最小サイズに設定し、その値を最適サイズと混ぜあわせた上で、その結果をウィジェットのサイズとして設定します。

source: Rather than just setting an "initial size" attribute it actually sets the minsize to the value passed in, blends that value with the best size, and then sets the size of the widget to be the result.
ja: 単に "初期サイズ" を設定するのではなく、引き渡された値を最小サイズに設定し、その値を最適サイズと混ぜあわせた上で、その結果をウィジェットのサイズとして設定します。

source: Read it if you want to know more about how to write programs able to work with characters from languages other than English.
ja: 英語以外の言語で使用される文字を扱うプログラムを書く方法について、より詳しく知りたい場合はこの章を読んでください。

source: Really last point is the consequence of the previous one: because of increased flexibility of Bind(), it is also safer as it is impossible to accidentally use a method of another class.
ja: 最後のポイントは前述のポイントの帰結です: Bind() の柔軟性が向上したため、うっかり他クラスのメンバ関数を使用してしまうことが不可能になり、安全性も向上しました。

source: Related classes: wxEvtHandler, wxWindow, wxEvent
ja: 関連クラス: wxEvtHandler, wxWindow, wxEvent

source: Related Pages
ja: 関連ページ

source: Remarks:
ja: 注意:

source: Replaces the text starting at the first position up to (but not including) the character at the last ...
ja: 最初の位置から最後の位置まで (ただし、含みません) のテキストを置き換えます。

source: Represents a protocol for use with wxURL.
ja: wxURL で使用するプロトコルを表しています。

source: Result returned from a wxDropSource::DoDragDrop() call.
ja: wxDropSource::DoDragDrop() から返却された結果。

source: Return the localized resources directory containing the resource files of the specified category for ...
ja: 所定の言語について、指定されたカテゴリのリソースファイルが含まれるディレクトリを返却します。

source: Returns a copy of the event.
ja: イベントのコピーを返却します。

source: Returns a lightweight intermediate class which is in turn implicitly convertible to both const char* ...
ja: 暗黙的に const char* や const wchar_t* へ変換可能な軽量の中間クラスを返却します。

source: Returns an object with string data that is implicitly convertible to char* pointer.
ja: 暗黙的に char* ポインタへ変換可能な文字列データを持つオブジェクトを返却します。

source: Returns the length of the string (same as Len).
ja: 文字列の長さを返却します (Len と同じです)。

source: Returns the length of the string.
ja: 文字列の長さを返却します。

source: Returns the multibyte (C string) representation of the string using conv's wxMBConv::cWC2MB method an...
ja: wxMBConv::cWC2MB 関数を使用して文字列をマルチバイト (C 形式) 表現方法に変換し、wxCharBuffer として返却します。

source: Returns the number of system CPUs or -1 if the value is unknown.
ja: CPU の数か、数が不明な場合は -1 を返却します。

source: Returns the object (usually a window) associated with the event, if any.
ja: イベントに関連付けられているオブジェクト (通常はウィンドウです) がある場合、それを返却します。

source: Returns the orientation of the box sizer, either wxVERTICAL or wxHORIZONTAL.
ja: ボックスサイザーの方向を返します。 wxVERTICAL か wxHORIZONTAL のいずれかの値です。

source: Returns the size of the entire window in pixels, including title bar, border, scrollbars, etc.
ja: タイトルバー、ボーダー、スクロールバーなどを含む、ウィンドウ全体のサイズをピクセル単位で返却します。

source: Returns this string converted to upper case.
ja: 大文字へ変換した文字列を返却します。

source: Returns true if the dialog box is modal, false otherwise.
ja: ダイアログボックスがモーダルの場合に true を、それ以外の場合は false を返却します。

source: Returns true if the window is enabled, i.e.
ja: ウィンドウが有効化されている場合に true を返却します。

source: Returns true if this dialog can and should perform layout adaptation using DoLayoutAdaptation(), usually if the dialog is too large to fit on the display.
ja: このダイアログが DoLayoutAdaptation() を用いてレイアウトの適応を行なうことができ、また、行なう必要がある場合に true を返却します。これは通常、画面サイズに対してダイアログが大きすぎる場合に行われます。

source: Returns true if you can veto a system shutdown or a window close event.
ja: システムシャットダウンやウィンドウの終了イベントを拒否できる場合に true を返却します。

source: Returns wxEVT_CATEGORY_THREAD.
ja: wxEVT_CATEGORY_THREAD を返却します。

source: Run the server, then the client.
ja: サーバを実行し、それからクライアントを実行してください。

source: Same as utf8_str().
ja: utf8_str() と同じです。

source: Scrolled window derived from wxPanel.
ja: wxPanel を継承したスクロール可能なウィンドウ。

source: Search
ja: 検索

source: Secondly, the application should call wxWindow::TransferDataFromWindow and return if this failed.
ja: 次に wxWindow::TransferDataFromWindow が呼ばれます。この関数が失敗した場合は呼び出し元へ戻ります。

source: See Standard event identifiers for the list of standard identifiers available.
ja: 使用可能な標準識別子のリストは 標準イベント識別子 を参照してください。

source: See wxMemoryDC for an example of drawing onto a bitmap.
ja: ビットマップへの描画の例は wxMemoryDC を参照してください。

source: See wxScrolled for more info.
ja: より詳しい情報は wxScrolled を参照してください。

source: See wxCSConv and wxMBConv.
ja: wxCSConv と wxMBConv を参照してください。

source: See wxString Overview for more info.
ja: 詳しくは wxString の概要 を参照してください。

source: See also
ja: 参照

source: See also Writing non-English applications.
ja: 非英語アプリケーションの作成 も参照してください。

source: See also http://unicode.org/glossary/ for the official definitions of the terms reported above.
ja: 上で述べた用語の正式な定義は http://unicode.org/glossary/ を参照してください。

source: See also wxPanel and wxWindow for inherited member functions.
ja: また、wxDialog が継承している関数については wxPanel と wxWindow を参照してください。

source: See also wxTopLevelWindow and wxWindow for inherited member functions.
ja: また、wxDialog が継承している関数については wxTopLevelWindow と wxWindow を参照してください。

source: See also Most important wxUSE symbols.
ja: もっとも重要な wxUSE シンボル も参照してください。

source: See also the Thread Sample for a sample showing some simple interactions between the main and secondary threads.
ja: メインスレッドとサブスレッド間の単純なやり取りの例として スレッドサンプル も参照してください。

source: See also the event sample for an example of code defining and working with the custom event types.
ja: コードの書き方とカスタムイベント型の動作例として イベントサンプル も参照してください。

source: See also the Event Sample for a complete example of code defining and working with the custom event types.
ja: コードの書き方とカスタムイベント型の動作例として イベントサンプル も参照してください。

source: See also the GNU gettext documentation linked from docs/html/index.htm in your wxWidgets distribution.
ja: GNU gettext のドキュメントも参照してください。これは wxWidgets の配布物の中にある docs/html/index.htm からリンクしています。

source: See also:
ja: 参照:

source: See also: wxDataObject Overview and Drag & Drop Sample.
ja: 参照: wxDataObject の概要 と ドラッグ・アンド・ドロップのサンプル

source: See also: wxDataObject overview and DnD sample
ja: 参照: wxDataObject の概要 と ドラッグ・アンド・ドロップのサンプル
